Tekla Open API Reference for Tekla Structures 2025
ModelObject.ModelIdentifier Property
 The database identifier of the model object in the model database. By using this identifier, it is possible to select the actual object in the Tekla Structures model.
 Namespace: Tekla.Structures.Drawing
 Assembly: Tekla.Structures.Drawing (in Tekla.Structures.Drawing.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public Identifier ModelIdentifier { get; }
Public ReadOnly Property ModelIdentifier As Identifier
	Get
Property Value
Type: Identifier
See Also
Reference
ModelObject Class
Tekla.Structures.Drawing Namespace